import random

print("7-3. 20203035 김석준\n")

print("#####################################")
print("#       오늘의       수학문제       #")
print("#####################################\n")

ques = [ "514 * 516 = 265224 ", " 10 + 10 =20 ", "100 * 2 =200",
        "10761 - 9999  = 762 " , "341 - 154 = 187", "100 - 90 = 10" , "50 * 30 = 1500", "800- 300 = 500", "1000 / 2 = 500", "500/5 = 100"]
conti = 1
num = 1
while conti ==1:
    print("문제 {}. {}".format(num, random.choice(ques)))
    print("마치려면 -1, 계속하려면 1 :",end = " ")
    conti = int(input())
    num += 1
    
